###### Q. titanic 데이터 셋에서 age, fare 2개 열을 선택하여 데이터프레임 df를 만드세요

In [1]:
import seaborn as sns

titanic = sns.load_dataset('titanic')

df = titanic.loc[:, ['age', 'fare']]
print(df.head())

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

###### Q. 10을 더하는 함수 add 10 과 두 객체의 합 add_two_obj 함수를 정의한 후 결과값이 각각 20과 20을 출력하세요.

In [2]:
import pandas as pd

def add_10(n):
    return n + 10

def add_two_obj(a, b):
    return a + b

print(add_10(10))
print(add_two_obj(10, 10))

20
20

###### Q. 10을 곱하는 사용자 함수와 두 객체의 나눗셈을 수행하는 사용자 함수를 정의한 후 결과 값이 각각 200과 10을 출력하세요.

In [6]:
def mul_10(n):
    return n * 10

def div_two_obj(a, b):
    return a / b

print(mul_10(20))
print(div_two_obj(mul_10(20), add_10(10)))
print(div_two_obj(100, 10))

200
10.0
10.0

###### Q.

In [9]:
df_age = df['age']
print(df_age)
print()
sr1 = df_age.apply(add_10)
print(sr1.head())

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

###### Q. 시리즈 객체 + 숫자를 연산하는 방식으로 df.age에 10을 더한 후 sr2에 저장하고 출력하세요.

In [10]:
# 시리즈 원소에 함수 매핑
def add_two_obj(a, b):     # 두 객체의 합
    return a + b
sr2 = df.age.apply(add_two_obj, b=10)
sr2

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

###### Q. f람다 함수를 활용해서 위와 같은 연산을 수행하고 결과를 sr3로 출력하세요.

In [11]:
sr3 = df.age.apply(lambda x: add_10(x))
sr3

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

###### Q. df의 'age', 'fare' 칼럼에 10을 사칙연산 하는 사용자 함수를 정의하고 applymap()으로 각 사용자 함수를 매핑한 후 출력하세요.

In [12]:
# 데이터프레임의 원소에 applymap() 적용
# 데이터프레임의 개별 원소에 특정 함수를 매핑하려면 applymap() 메소드 활용.

import pandas as pd

df_map = df.applymap(add_10)
df_map.head(3)

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250

###### Q. df_map의 [0, 0]을 NaN으로 변경한 후 missing_value 함수를 적용해서 불린 시리즈를 반환하세요.

In [24]:
import numpy as np

def missing_value(series):
    return series.isnull()

df_map.iloc[0, 0] = np.nan
print(df_map)
result = df_map.apply(missing_value, axis=0)
print(result)

      age     fare
0     NaN  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]
       age   fare
0     True  False
1    False  False
2    False  False
3    False  False
4    False  False
..     ...    ...
886  False  False
887  False  False
888   True  False
889  False  False
890  False  False

[891 rows x 2 columns]

###### Q. titanic 데이터셋을 seaborn에서 로딩한 후 불린 인덱싱을 이용하여 아래 사항들을 출력하세요
- 나이가 10대(10~19세)인 승객만 따로 선택
- 나이가 10세 미만(0~9세)이고 여성인 승객만 따로 선택
- 나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 age, sex, alone 열만 선택

In [25]:
import seaborn as sns

titanic = sns.load_dataset('titanic')

# 나이가 10대(10~19세)인 승객만 따로 선택
mask1 = (titanic.age >= 10)&(titanic.age < 20)
df_teenage = titanic.loc[mask1, :]
print(df_teenage.head())

    survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
9          1       2  female  14.0      1      0   30.0708        C  Second
14         0       3  female  14.0      0      0    7.8542        S   Third
22         1       3  female  15.0      0      0    8.0292        Q   Third
27         0       1    male  19.0      3      2  263.0000        S   First
38         0       3  female  18.0      2      0   18.0000        S   Third

      who  adult_male deck  embark_town alive  alone
9   child       False  NaN    Cherbourg   yes  False
14  child       False  NaN  Southampton    no   True
22  child       False  NaN   Queenstown   yes   True
27    man        True    C  Southampton    no  False
38  woman       False  NaN  Southampton    no  False

In [26]:
# 나이가 10세 미만(0~9세)이고 여성인 승객만 따로 선택

mask2 = (titanic.age < 10) & (titanic.sex == 'female')
df_female_under10 = titanic.loc[mask2, :]
print(df_female_under10.head())

     survived  pclass     sex  age  sibsp  parch     fare embarked   class  \
10          1       3  female  4.0      1      1  16.7000        S   Third
24          0       3  female  8.0      3      1  21.0750        S   Third
43          1       2  female  3.0      1      2  41.5792        C  Second
58          1       2  female  5.0      1      2  27.7500        S  Second
119         0       3  female  2.0      4      2  31.2750        S   Third

       who  adult_male deck  embark_town alive  alone
10   child       False    G  Southampton   yes  False
24   child       False  NaN  Southampton    no  False
43   child       False  NaN    Cherbourg   yes  False
58   child       False  NaN  Southampton   yes  False
119  child       False  NaN  Southampton    no  False

In [28]:
# 나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 age, sex, alone 열만 선택

mask3 = (titanic.age < 10) | (titanic.age >= 60)
df_under10_morethan60 = titanic.loc[mask3, ['age', 'sex', 'alone']]
print(df_under10_morethan60.head())

     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

###### Q. 최대값 - 최소값을 반환하는 사용자 함수를 min_max로 정의하고 age, fare 열로 구성되는 타이타닉 데이터프레임 df에 적용하여 결과와 자료형을 출력하세요. source : titanic = sns.load_dataset('titanic')

In [34]:
import seaborn as sns
import pandas as pd

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
df.to_pickle('af_df.pkl')

df = pd.read_pickle('af_df.pkl')
print(df)

# 사용자 함수 정의
def min_max(x):    # 최대값 - 최소값
    return x.max() - x.min()

result = df.apply(min_max)
print(result)
print()
print(type(result))

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]
age      79.5800
fare    512.3292
dtype: float64

<class 'pandas.core.series.Series'>

###### Q. 타이타닉 df의 열 순서를 아래와 같이 재구성하고 출력하세요.
- 열선택 : ['pclass', 'sex', 'age', 'survived']
- 열 이름의 리스트 만들기
- 열 이름을 알파벳 순으로 정렬하기
- 열 이름을 기존 순서의 정반대 역순으로 정렬하기
- 열 이름을 사용자가 정의한 임의의 순서로 배치하기

In [39]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
df = titanic.loc[0:4, 'survived':'age']

# 열 이름의 리스트 만들기
# columns = list(df.columns.values)   # 기존 열 이름
# print(columns, '\n')

# 열 이름을 알파벳 순으로 정렬하기
# columns_sorted = sorted(columns)  # 알파벳 순으로 정렬
# df_sorted = df[columns_sorted]
# print(df_sorted, '\n')

# # 열 이름을 기존 순서의 정반대 역순으로 정렬하기
# columns_reversed = list(reversed(columns))
# df_reversed = df[columns_reversed]
# print(df_reversed, '\n')

# # 열 이름을 사용자가 정의한 임의의 순서로 재배치 하기
columns_customed = ['pclass', 'sex', 'age', 'survived']
df_customed = df[columns_customed]
print(df_customed)

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

## 데이터 프레임 연결
- 서로 다른 데이터 프레임의 구성 형태와 속성이 균일하다면 행 또는 열 중에 어느 한 방향으로 붙여도 데이터의 일관성 유지
- 기존 데이터 프레임의 형태를 유지하면서 이어 붙이는 개념으로 판다스 Concat() 함수를 활용

In [50]:
import numpy as np
import pandas as pd

a = np.arange(start = 0, stop = 12)
a
a1 = a.reshape(4,3)
df1 = pd.DataFrame(a1, columns=['a','b','c'])

display(df1)
print()

b= np.arange(start=0, stop=16)
b
b1 = b.reshape(4,4)
b1
df2 = pd.DataFrame(b1, columns=['a','b','c','d'])

display(df2)

df3 = pd.concat([df1, df2], axis=1)
display(df3)

df4 = pd.concat([df1, df2], axis=0)
display(df4)

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

   a   b   c   a   b   c   d
0  0   1   2   0   1   2   3
1  3   4   5   4   5   6   7
2  6   7   8   8   9  10  11
3  9  10  11  12  13  14  15

    a   b   c     d
0   0   1   2   NaN
1   3   4   5   NaN
2   6   7   8   NaN
3   9  10  11   NaN
0   0   1   2   3.0
1   4   5   6   7.0
2   8   9  10  11.0
3  12  13  14  15.0